{
  "intents": [
    {
      "tag": "Welcome",
      "patterns": ["Hello", "Hey there", "How are you?", "Hi", "Greetings"],
      "responses": ["Hey there! How can I help you?"]
    },
    {
      "tag": "Article 1",
      "patterns": [
        "What defines Saudi Arabia with Islam as its religion, Arabic as its language, and Riyadh as its capital?",
        "Can you tell me about Saudi Arabia being an Arab Islamic state with Arabic as its language and Riyadh as its capital?",
        "What are the main features of Saudi Arabia as an Arab Islamic state with Islam as its foundation and Arabic as its language?",
        "Tell me about Saudi Arabia, its religion, language, and capital.",
        "What makes Saudi Arabia a sovereign Arab Islamic state with Riyadh as its hub?",
        "Tell me about the Kingdom of Saudi Arabia.",
        "Give me details about Saudi Arabia.",
        "I want to learn more about Saudi Arabia.",
        "Describe Saudi Arabia for me."
      ],
      "responses": [
        "Saudi Arabia is an Arab Islamic state with Islam as its religion, Arabic as its language, and Riyadh as its capital."
      ]
    },
    {
      "tag": "Article 2",
      "patterns": [
        "Which holidays does Saudi Arabia observe, like Eid al-Fitr and Eid al-Adha, according to the Hijri calendar?",
        "Can you list the holidays in Saudi Arabia, such as Eid al-Fitr and Eid al-Adha, following the Islamic calendar?",
        "What are the public holidays in Saudi Arabia based on the Hijri calendar?",
        "Tell me about the main holidays celebrated in Saudi Arabia according to the Islamic calendar.",
        "What holidays does Saudi Arabia recognize, like Eid al-Fitr and Eid al-Adha, based on the Hijri calendar?",
        "Tell me about the public holidays in Saudi Arabia.",
        "What special occasions does Saudi Arabia celebrate?",
        "Give me information about Saudi Arabian holidays.",
        "What are the official holidays in Saudi Arabia?"
      ],
      "responses": [
        "Saudi Arabia observes public holidays like Eid al-Fitr and Eid al-Adha, following the Hijri calendar."
      ]
    },
    {
      "tag": "Article 3",
      "patterns": [
        "Describe the flags color",
        "Describe the flag of Saudi Arabia.",
        "What does the Saudi Arabian flag look like?",
        "Can you give me details about the flag of Saudi Arabia?",
        "Tell me about the national flag of Saudi Arabia.",
        "What are the characteristics of the Saudi Arabian flag?",
        "Tell me about Saudi Arabia's flag.",
        "Give me information about the flag of Saudi Arabia.",
        "What are the specifications for the flag of Saudi Arabia?",
        "I want to know more about the flag of Saudi Arabia."
      ],
      "responses": [
        "The flag of Saudi Arabia is green, with a width equal to two-thirds of its length. It bears the inscription 'There is but one God and Muhammad is His Prophet' with a drawn sword underneath. The rules regarding it are defined by law."
      ]
    },
    {
      "tag": "المادة 1",
      "patterns": [
        "ما هو تعريف المملكة العربية السعودية، بالإسلام كديانة لها، والعربية كلغتها، والرياض كعاصمة لها؟",
        "ما هي ملامح الرئيسية للمملكة العربية السعودية كدولة عربية إسلامية ذات سيادة، بالإسلام كأساس لها والعربية كلغة لها؟",
        "اشرح المملكة العربية السعودية، ديانتها، لغتها، وعاصمتها.",
        "ما الذي يجعل المملكة العربية السعودية دولة عربية إسلامية ذات سيادة؟",
        "اعطني معلومات عن المملكة العربية السعودية."
      ],
      "responses": [
        "المملكة العربية السعودية دولة عربية إسلامية ذات سيادة، والإسلام ديانتها؛ والعربية لغتها، والرياض عاصمتها."
      ]
    },
    {
      "tag": "المادة ٢",
      "patterns": [
        "ما هي الأعياد التي تحتفل بها السعودية، مثل عيد الفطر وعيد الأضحى، باتباع التقويم الهجري؟",
        "أي الأعياد التي تعترف بها السعودية، مثل عيد الفطر وعيد الأضحى، وفقًا للتقويم الهجري؟",
        "ما هي الأعياد الرئيسية في السعودية، مثل عيد الفطر وعيد الأضحى، وفقًا للتقويم الهجري؟",
        "اعطني قائمة بالأعياد في السعودية.",
        "ما هي المناسبات الخاصة التي تحتفل بها السعودية؟"
      ],
      "responses": [
        "الأعياد الرسمية للسعودية هي عيد الفطر وعيد الأضحى، وتستخدم التقويم الهجري."
      ]
    },
    {
      "tag": "المادة ٣",
      "patterns": [
        "صف علم السعودية.",
        "ما هو شكل علم السعودية؟",
        "هل يمكنك إعطائي تفاصيل عن علم السعودية؟",
        "اشرح العلم الوطني للسعودية.",
        "احكيلي عن علم السعودية.",
        "أعطني معلومات عن علم السعودية.",
        "ما هي المواصفات لعلم السعودية؟",
        "أريد معرفة المزيد عن علم السعودية."
      ],
      "responses": [
        "علم السعودية أخضر اللون، وعرضه يساوي ثلاثة أرباع طوله، ويحمل النقشة (لا إله إلا الله محمد رسول الله) مع سيف مسلط تحته، وتحدده القوانين."
      ]
    },
    {
      "tag": "",
      "patterns": [
        "السلام عليكم",
        "مرحباً",
        "أهلا",
        "مرحبا بك",
        "مساء الخير",
        "صباح الخير",
        "أهلًا وسهلًا"
      ],
      "responses": ["مرحباأهلاً", "صباح الخير", "مساء الخير", "أهلًا وسهلًا"]
    },
    {
      "tag": "نظام الحكم في المملكة العربية السعودية",
      "patterns": [
        "ما هي المادة السادسة في التعديل؟",
        "المادة السادسة من التعديل",
        "مادة السادسة في النظام الحكومي",
        "أين يمكنني العثور على المادة السادسة؟",
        "أريد معرفة المادة السادسة في النظام السعودي",
        "هل يمكنك شرح المادة السادسة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "يبايع المواطنون الملك على كتاب الله وسنة رسوله وعلى السمع والطاعة في العسر واليسر والمنشط والمكره."
      ]
    },
    {
      "tag": "نظام الحكم في المملكة العربية السعودية",
      "patterns": [
        "ما هي المادة السابعة في التعديل؟",
        "المادة السابعة من التعديل",
        "مادة السابعة في النظام الحكومي",
        "أين يمكنني العثور على المادة السابعة؟",
        "أريد معرفة المادة السابعة في النظام السعودي",
        "هل يمكنك شرح المادة السابعة في النظام الحكومي للسعودية؟",
        "ما هو النص الخاص بالمادة السابعة؟",
        "المادة السابعة من النظام السعودي",
        "مادة السابعة في الحكم بالمملكة العربية السعودية"
      ],
      "responses": [
        "يستمد الحكم في المملكة العربية السعودية سلطته من كتاب الله وسنة رسوله، وهما الأساسان على هذا النظام وجميع أنظمة الدولة."
      ]
    },
    {
      "tag": "نظام الحكم في المملكة العربية السعودية",
      "patterns": [
        "ما هي المادة الثامنة في التعديل؟",
        "المادة الثامنة من التعديل",
        "مادة الثامنة في النظام الحكومي",
        "أين يمكنني العثور على المادة الثامنة؟",
        "أريد معرفة المادة الثامنة في النظام السعودي",
        "هل يمكنك شرح المادة الثامنة في النظام الحكومي للسعودية؟",
        "ما هو النص الخاص بالمادة الثامنة؟",
        "المادة ٨ من النظام السعودي",
        "مادة الثامنة في الحكم بالمملكة العربية السعودية"
      ],
      "responses": [
        "يقوم الحكم في المملكة العربية السعودية على أساس العدل والشورى والمساواة وفق الشريعة الإسلامية."
      ]
    },
    {
      "tag": "مقومات المجتمع السعودي",
      "patterns": [
        "ما هي المادة التاسعة في التعديل؟",
        "المادة التاسعة من التعديل",
        "مادة التاسعة في النظام الحكومي",
        "أين يمكنني العثور على المادة التاسعة؟",
        "أريد معرفة المادة التاسعة في النظام السعودي",
        "هل يمكنك شرح المادة التاسعة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "أسرة هي نواة المجتمع السعودي، وتربى أفرادها على أساس العقيدة الإسلامية وما تقتضيه من الولاء والطاعة لله ولرسوله وأولي الأمر، واحترام النظام وتنفيذه وحب الوطن والعتزاز به وبتاريخه المجيد."
      ]
    },
    {
      "tag": "مقومات المجتمع السعودي",
      "patterns": [
        "ما هي المادة العاشرة في التعديل؟",
        "المادة العاشرة من التعديل",
        "مادة العاشرة في النظام الحكومي",
        "أين يمكنني العثور على المادة العاشرة؟",
        "أريد معرفة المادة العاشرة في النظام السعودي",
        "هل يمكنك شرح المادة العاشرة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "تحرص الدولة على توثيق أواصر الأسرة والحفاظ على قيمها العربية والإسلامية ورعاية جميع أفرادها وتوفير الظروف المناسبة لتنمية ملكاتهم وقدراتهم."
      ]
    },
    {
      "tag": "مقومات المجتمع السعودي",
      "patterns": [
        "ما هي المادة الحادية عشرة في التعديل؟",
        "المادة الحادية عشرة من التعديل",
        "مادة الحادية عشرة في النظام الحكومي",
        "أين يمكنني العثور على المادة الحادية عشرة؟",
        "أريد معرفة المادة الحادية عشرة في النظام السعودي",
        "هل يمكنك شرح المادة الحادية عشرة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "يقوم المجتمع السعودي على أساس من اعتصام أفراده بحبل الله وتعاونهم على البر والتقوى والتكافل فيما بينهم وعدم تفرقهم."
      ]
    },
    {
      "tag": "مقومات المجتمع السعودي",
      "patterns": [
        "ما هي المادة الثانية عشرة في التعديل؟",
        "المادة الثانية عشرة من التعديل",
        "مادة الثانية عشرة في النظام الحكومي",
        "أين يمكنني العثور على المادة الثانية عشرة؟",
        "أريد معرفة المادة الثانية عشرة في النظام السعودي",
        "هل يمكنك شرح المادة الثانية عشرة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "تعزيز الوحدة الوطنية واجب، وتنهي الدولة كل ما يؤدي للفرقة والفتنة والانقسام."
      ]
    },
    {
      "tag": "مقومات المجتمع السعودي",
      "patterns": [
        "ما هي المادة الثالثة عشرة في التعديل؟",
        "المادة الثالثة عشرة من التعديل",
        "مادة الثالثة عشرة في النظام الحكومي",
        "أين يمكنني العثور على المادة الثالثة عشرة؟",
        "أريد معرفة المادة الثالثة عشرة في النظام السعودي",
        "هل يمكنك شرح المادة الثالثة عشرة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "يهدف التعليم في المملكة العربية السعودية إلى غرس العقيدة الإسلامية في نفوس النشء وإكسابهم المعارف والمهارات وتهيئتهم ليكونوا أعضاء نافعين في بناء مجتمعهم محبين لوطنهم ومعتزين بتاريخه."
      ]
    },
    {
      "tag": "المبادئ الاقتصادية",
      "patterns": [
        "ما هي المادة الرابعة عشرة في التعديل؟",
        "المادة الرابعة عشرة من التعديل",
        "مادة الرابعة عشرة في النظام الحكومي",
        "أين يمكنني العثور على المادة الرابعة عشرة؟",
        "أريد معرفة المادة الرابعة عشرة في النظام السعودي",
        "هل يمكنك شرح المادة الرابعة عشرة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "جميع الثروات التي أودعها الله في باطن الأرض أو في ظاهرها أو في المياه الإقليمية أو في النطاق البري والبحري الذي يمتد إليه اختصاص الدولة وجميع موارد تلك الثروات يبني النظام وسائل ملك للدولة وفقًا لاستغلال هذه الثروات وحمايتها وتنميتها ما لم فيه مصلحة الدولة وأمنها واقتصادها."
      ]
    },
    {
      "tag": "المبادئ الاقتصادية",
      "patterns": [
        "ما هي المادة الخامسة عشرة في التعديل؟",
        "المادة الخامسة عشرة من التعديل",
        "مادة الخامسة عشرة في النظام الحكومي",
        "أين يمكنني العثور على المادة الخامسة عشرة؟",
        "أريد معرفة المادة الخامسة عشرة في النظام السعودي",
        "هل يمكنك شرح المادة الخامسة عشرة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "ال لا يجوز منح امتياز أو استثمار مورد من موارد البلد العامة إلا بحسب نظام."
      ]
    },
    {
      "tag": "المبادئ الاقتصادية",
      "patterns": [
        "ما هي المادة السادسة عشرة في التعديل؟",
        "المادة السادسة عشرة من التعديل",
        "مادة السادسة عشرة في النظام الحكومي",
        "أين يمكنني العثور على المادة السادسة عشرة؟",
        "أريد معرفة المادة السادسة عشرة في النظام السعودي",
        "هل يمكنك شرح المادة السادسة عشرة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "لألموال العامة حرمتها وعلى الدولة حمايتها وعلى المواطنين والمقيمين احترامها والحفاظ عليها."
      ]
    },
    {
      "tag": "المبادئ الاقتصادية",
      "patterns": [
        "ما هي المادة السابعة عشرة في التعديل؟",
        "المادة السابعة عشرة من التعديل",
        "مادة السابعة عشرة في النظام الحكومي",
        "أين يمكنني العثور على المادة السابعة عشرة؟",
        "أريد معرفة المادة السابعة عشرة في النظام السعودي",
        "هل يمكنك شرح المادة السابعة عشرة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "الملكية ورأس المال والعمل مقومات أساسية في الكيان الاقتصادي والاجتماعي للمملكة وهي حقوق خاصة تؤدي وظيفة اجتماعية وفق الشريعة الإسلامية."
      ]
    },
    {
      "tag": "المبادئ الاقتصادية",
      "patterns": [
        "ما هي المادة الثامنة عشرة في التعديل؟",
        "المادة الثامنة عشرة من التعديل",
        "مادة الثامنة عشرة في النظام الحكومي",
        "أين يمكنني العثور على المادة الثامنة عشرة؟",
        "أريد معرفة المادة الثامنة عشرة في النظام السعودي",
        "هل يمكنك شرح المادة الثامنة عشرة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "تكفل الدولة حرية الملكية الخاصة وحرمتها، ولا ينزع من أحد ملكه إلا للمصلحة العامة على أن يعوض المالك تعويضًا عادلًا."
      ]
    },
    {
      "tag": "المبادئ الاقتصادية",
      "patterns": [
        "ما هي المادة التاسعة عشرة في التعديل؟",
        "المادة التاسعة عشرة من التعديل",
        "مادة التاسعة عشرة في النظام الحكومي",
        "أين يمكنني العثور على المادة التاسعة عشرة؟",
        "أريد معرفة المادة التاسعة عشرة في النظام السعودي",
        "هل يمكنك شرح المادة التاسعة عشرة في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "تحظر المصادرة العامة لأموال ولا تكون عقوبة المصادرة العامة إلا بحكم قضائي."
      ]
    },
    {
      "tag": "المبادئ الاقتصادية",
      "patterns": [
        "ما هي المادة العشرون في التعديل؟",
        "المادة العشرون من التعديل",
        "مادة العشرون في النظام الحكومي",
        "أين يمكنني العثور على المادة العشرون؟",
        "أريد معرفة المادة العشرون في النظام السعودي",
        "هل يمكنك شرح المادة العشرون في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "ال تفرض الضرائب أو الرسوم إلا عند الحاجة وعلى أساس من العدل، وال لا يجوز فرضها أو تعديلها أو إلغاؤها أو الإعفاء منها إلا بحسب النظام."
      ]
    },
    {
      "tag": "المبادئ الاقتصادية",
      "patterns": [
        "ما هي المادة الحادية والعشرون في التعديل؟",
        "المادة الحادية والعشرون من التعديل",
        "مادة الحادية والعشرون في النظام الحكومي",
        "أين يمكنني العثور على المادة الحادية والعشرون؟",
        "أريد معرفة المادة الحادية والعشرون في النظام السعودي",
        "هل يمكنك شرح المادة الحادية والعشرون في النظام الحكومي للسعودية؟"
      ],
      "responses": ["يُجبى الزكاة وتنفق في مصارفها الشرعية."]
    },
    {
      "tag": "المبادئ الاقتصادية",
      "patterns": [
        "ما هي المادة الثانية والعشرون في التعديل؟",
        "المادة الثانية والعشرون من التعديل",
        "مادة الثانية والعشرون في النظام الحكومي",
        "أين يمكنني العثور على المادة الثانية والعشرون؟",
        "أريد معرفة المادة الثانية والعشرون في النظام السعودي",
        "هل يمكنك شرح المادة الثانية والعشرون في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "يتم تحقيق التنمية الاقتصادية والاجتماعية وفقًا لخطة علمية عادلة."
      ]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة الثالثة والعشرون في التعديل؟",
        "المادة الثالثة والعشرون من التعديل",
        "مادة الثالثة والعشرون في النظام الحكومي",
        "أين يمكنني العثور على المادة الثالثة والعشرون؟",
        "أريد معرفة المادة الثالثة والعشرون في النظام السعودي",
        "هل يمكنك شرح المادة الثالثة والعشرون في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "تضمن الدولة عقيدة الإسلام وتطبق شريعتها وتأمر بالمعروف وتنهي عن المنكر وتقوم بواجب الدعوة إلى الله."
      ]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة الرابعة والعشرون في التعديل؟",
        "المادة الرابعة والعشرون من التعديل",
        "مادة الرابعة والعشرون في النظام الحكومي",
        "أين يمكنني العثور على المادة الرابعة والعشرون؟",
        "أريد معرفة المادة الرابعة والعشرون في النظام السعودي",
        "هل يمكنك شرح المادة الرابعة والعشرون في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "تقوم الدولة بإعمار الحرمين الشريفين وخدمتهما وتوفر الأمن والرعاية لقاصديهما من أجل أداء الحج والعمرة والزيارة بيسر وطمأنينة."
      ]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة الخامسة والعشرون في التعديل؟",
        "المادة الخامسة والعشرون من التعديل",
        "مادة الخامسة والعشرون في النظام الحكومي",
        "أين يمكنني العثور على المادة الخامسة والعشرون؟",
        "أريد معرفة المادة الخامسة والعشرون في النظام السعودي",
        "هل يمكنك شرح المادة الخامسة والعشرون في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "ترصد الدولة العناية بأمة الإسلام والعربية في التضامن وتوحيد الكلمة، وتقوية علاقاتها بالدول الصديقة."
      ]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة السادسة والعشرون في التعديل؟",
        "المادة السادسة والعشرون من التعديل",
        "مادة السادسة والعشرون في النظام الحكومي",
        "أين يمكنني العثور على المادة السادسة والعشرون؟",
        "أريد معرفة المادة السادسة والعشرون في النظام السعودي",
        "هل يمكنك شرح المادة السادسة والعشرون في النظام الحكومي للسعودية؟"
      ],
      "responses": ["تضمن الدولة حقوق الإنسان وفقًا للشريعة الإسلامية."]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة السابعة والعشرون في التعديل؟",
        "المادة السابعة والعشرون من التعديل",
        "مادة السابعة والعشرون في النظام الحكومي",
        "أين يمكنني العثور على المادة السابعة والعشرون؟",
        "أريد معرفة المادة السابعة والعشرون في النظام السعودي",
        "هل يمكنك شرح المادة السابعة والعشرون في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "تكفل الدولة حق المواطن وأسرته في حالة الطوارئ والمرض والعجز والشيخوخة، وتدعم الضمان الاجتماعي وتشجع المؤسسات والأفراد على المساهمة في الأعمال الخيرية."
      ]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة الثامنة والعشرون في التعديل؟",
        "المادة الثامنة والعشرون من التعديل",
        "مادة الثامنة والعشرون في النظام الحكومي",
        "أين يمكنني العثور على المادة الثامنة والعشرون؟",
        "أريد معرفة المادة الثامنة والعشرون في النظام السعودي",
        "هل يمكنك شرح المادة الثامنة والعشرون في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "تيسر الدولة مجالات العمل لكل قادر عليه وتنظم الأنظمة التي تضمن الحقوق والواجبات للعامل وصاحب العمل."
      ]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة التاسعة والعشرون في التعديل؟",
        "المادة التاسعة والعشرون من التعديل",
        "مادة التاسعة والعشرون في النظام الحكومي",
        "أين يمكنني العثور على المادة التاسعة والعشرون؟",
        "أريد معرفة المادة التاسعة والعشرون في النظام السعودي",
        "هل يمكنك شرح المادة التاسعة والعشرون في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "ترعى الدولة العلوم والآداب والثقافة وتعنى بتشجيع البحث العلمي وتصون التراث الإسلامي والعربي وتسهم في الحضارة العربية والإسلامية والإنسانية."
      ]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة الثلاثون في التعديل؟",
        "المادة الثلاثون من التعديل",
        "مادة الثلاثون في النظام الحكومي",
        "أين يمكنني العثور على المادة الثلاثون؟",
        "أريد معرفة المادة الثلاثون في النظام السعودي",
        "هل يمكنك شرح المادة الثلاثون في النظام الحكومي للسعودية؟"
      ],
      "responses": ["توفر الدولة التعليم العام وتلتزم بمكافحة الأمية."]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة الحادية والثلاثون في التعديل؟",
        "المادة الحادية والثلاثون من التعديل",
        "مادة الحادية والثلاثون في النظام الحكومي",
        "أين يمكنني العثور على المادة الحادية والثلاثون؟",
        "أريد معرفة المادة الحادية والثلاثون في النظام السعودي",
        "هل يمكنك شرح المادة الحادية والثلاثون في النظام الحكومي للسعودية؟"
      ],
      "responses": ["تعنى الدولة بالصحة العامة وتوفر الرعاية الصحية لكل مواطن."]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة الثانية والثلاثون في التعديل؟",
        "المادة الثانية والثلاثون من التعديل",
        "مادة الثانية والثلاثون في النظام الحكومي",
        "أين يمكنني العثور على المادة الثانية والثلاثون؟",
        "أريد معرفة المادة الثانية والثلاثون في النظام السعودي",
        "هل يمكنك شرح المادة الثانية والثلاثون في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "تعمل الدولة على المحافظة على البيئة وحمايتها وتطويرها ومنع التلوث."
      ]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة الثالثة والثلاثون في التعديل؟",
        "المادة الثالثة والثلاثون من التعديل",
        "مادة الثالثة والثلاثون في النظام الحكومي",
        "أين يمكنني العثور على المادة الثالثة والثلاثون؟",      
        "أريد معرفة المادة الثالثة والثلاثون في النظام السعودي",
        "هل يمكنك شرح المادة الثالثة والثلاثون في النظام الحكومي للسعودية؟"
      ],
      "responses": [
        "تنشئ الدولة القوات المسلحة وتجهزها للدفاع عن العقيدة والحرمين الشريفين والمجتمع والوطن."
      ]
    },
    {
      "tag": "الحقوق والواجبات",
      "patterns": [
        "ما هي المادة الرابعة والثلاثون في التعديل؟",
        "المادة الرابعة والثلاثون من التعديل",
        "مادة الرابعة والثلاثون في النظام الحكومي",
        "أين يمكنني العثور على المادة الرابعة والثلاثون؟",
        "أريد معرفة المادة الرابعة والثلاثون في النظام السعودي"
      ],
      "responses": [
        "الدفاع عن العقيدة الإسلامية والمجتمع والوطن واجب على كل مواطن وتضمن النظام أحكام الخدمة العسكرية."
      ]
    }
  ]
}
